ni9aii/fresnel-beacon/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASH_FREQ_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_TASK_WDT=y
# CONFIG_ESP_TASK_WDT_PANIC=n is intentional for development:
# a panic reboot would mask the root cause when debugging via serial.
# Switch to =y in production to ensure automatic recovery.
CONFIG_ESP_TASK_WDT_PANIC=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Main task stack size (sufficient for animation + HTTP server)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# RMT / LED driver
CONFIG_RMT_TX_TASK_PRIORITY=5
CONFIG_RMT_ISR_IRAM_SAFE=n

# NVS
# Note: Disable NVS encryption for CI builds (no eFuse keys available in simulation)
# CONFIG_NVS_ENCRYPTION=y
# CONFIG_NVS_ENCRYPTION_KEYS_IN_FLASH_EFUSE=y

# Partition table (default single-app is sufficient for now)
# CONFIG_PARTITION_TABLE_CUSTOM=y
# CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# mDNS
CONFIG_MDNS_ENABLED=y
